///▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼
//game.h
///▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲

///########## ヘッダファイル読み込み ##########
#include <windows.h>

///########## マクロ定義 ##########

///########## 構造体 ##########

///########## 名前の再定義 ##########

///▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼
#pragma once	//二重インクルードの防止
///▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼

///########## グローバル変数 参照の宣言 ##########

///▼▼▼▼▼ 本体はgame.cpp ▼▼▼▼▼

///▲▲▲▲▲ 本体はgame.cpp ▲▲▲▲▲

///########## 外部 関数 参照の宣言 ##########

///▼▼▼▼▼ 本体はgame.cpp ▼▼▼▼▼

//画面を描画する関数
extern VOID MY_DRAW_GAME(MY_WIN);

//画面の背景を描画する関数
extern VOID MY_DRAW_BACKSCREEN(HDC, RECT);

//画面の縦線を描画する関数
extern VOID MY_DRAW_LINE_TATE(HDC , RECT );

//画面の横線を描画する関数
extern VOID MY_DRAW_LINE_YOKO(HDC , RECT );

///▲▲▲▲▲ 本体はgame.cpp ▲▲▲▲▲