///▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼
//winproc.h
///▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲

///########## ヘッダファイル読み込み ##########
#include <windows.h>

///########## マクロ定義 ##########

///########## 列挙型 ##########

///########## 構造体 ##########

///########## 名前の再定義 ##########

///▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼
#pragma once	//二重インクルードの防止
///▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼

///########## グローバル変数の宣言と初期化 ##########

///########## 外部 関数 参照の宣言 ##########

///▼▼▼▼▼ 本体はwinproc.cpp ▼▼▼▼▼

//ウィンドウプロシージャ
extern LRESULT CALLBACK MY_WndProc(HWND, UINT, WPARAM, LPARAM);

///▲▲▲▲▲ 本体はwinproc.cpp ▲▲▲▲▲
